"""
주몽은 철기군을 양성하기 위한 프로젝트에 나섰다. 그래서 야철대장에게 철기군이 입을 갑옷을 만들라고 명령했다. 야철대장은 주몽의 명령에 따르기 위해 연구에 착수하던 중 갑옷을 만드는 재료들은 각각 고유한 번호가 있고, 갑옷은 2개의 재료로 만드는데 2가지 재료의 고유한 번호를 합쳐 M이되면 갑옷이 만들어진다는 사실을 발견했다. 야철대장은 자신이 만들고 있는 재료로 갑옷을 몇개나 만들 수 있는지 궁금해졋다. 야철대장의 궁금증을 풀어 주기 위해 N개의 재료와 M이 주어졌을 때 몇개의 갑옷을 만들 수 있는지를 구하는 프로그램을 작성하시오.

입력: 1번째 줄에 재료의 개수 N, 2번째 줄에 갑옷을 만드는 데 필요한 수 M이 주어진다. 3번째 줄에는 N개의 재료들이 가진 고유한 번호들이 공백을 사이에 두고 주어진다. 고유한 번호는 100,000보다 작거나 같은 자연수다.

출력: 1번째 줄에 갑옷을 만들 수 있는 개수를 출력한다.

시간복잡도 : O(nlog)
"""


import sys

input = sys.stdin.readline
N = int(input())
M = int(input())
A = list(map(int, input.split()))
A.sort()
count = 0
i = 0
j = N - 1

while i < j:
    if A[i] + A[j] < M:
        i += 1
    elif A[i] + A[j] > M:
        j -= 1
    else:
        count += 1
        i += 1
        j -= 1
print(count)
